{
    "_name_or_path": "google/vit-base-patch16-224-in21k",
    "architectures": [
      "ViTForImageClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "encoder_stride": 16,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "id2label": {
      "0": "cat",
      "1": "cow",
      "2": "dog",
      "3": "dolphin",
      "4": "eagle",
      "5": "giant panda",
      "6": "horse",
      "7": "monkey",
      "8": "sheep",
      "9": "spider"
    },
    "image_size": 224,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
      "cat": "0",
      "cow": "1",
      "dog": "2",
      "dolphin": "3",
      "eagle": "4",
      "giant panda": "5",
      "horse": "6",
      "monkey": "7",
      "sheep": "8",
      "spider": "9"
    },
    "layer_norm_eps": 1e-12,
    "model_type": "vit",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "problem_type": "single_label_classification",
    "qkv_bias": true,
    "torch_dtype": "float32",
    "transformers_version": "4.31.0"
  }